#include"title.h"

/***************************************************************
	∏≈∞≥∫Øºˆ : æ¯¿Ω
	±‚¥…	    : ¡æ∑· ¿Â∏È
****************************************************************/
void end1(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("                                                        (  ) (@@) ( )       @@      ()          \n");
	printf("                                                              (@@@)\n");
	printf("                                                         (      )\n");
	printf("                                                          ======            ________                    ______________\n");
	printf("                                                       _D__¶¢ ¶¢__________£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf("                                                       ¶¢(_)---    ¶¢   H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("                                                       £Ø     ¶¢   ¶¢   H   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("                                                      ¶¢      ¶¢   ¶¢   H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf("                                                      ¶¢  _________¶¢___H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("                                                      ¶¢£Ø   ¶¢ ¶¢-------------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf("                                                          __£Ø   =¶¢o¶¢=-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("                                                      ¶¢£Ø-== ¶¢_¶¢=    ¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø \n");
	printf("                                                       °¨_£Ø      °¨_0=======0=======0======0=£Ø    °¨ _£Ø   \n");
}
void end2(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("                                                 (  ) (@@) ( )       @@      ()          \n");
	printf("                                                       (@@@)\n");
	printf("                                                  (      )\n");
	printf("                                                   ======            ________                    ______________\n");
	printf("                                                _D__¶¢ ¶¢__________£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf("                                                ¶¢(_)---    ¶¢   H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("                                                £Ø     ¶¢   ¶¢   H   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("                                               ¶¢      ¶¢   ¶¢   H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf("                                               ¶¢  _________¶¢___H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("                                               ¶¢£Ø   ¶¢ ¶¢-------------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf("                                                   __£Ø   =¶¢o¶¢=-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("                                               ¶¢£Ø-== ¶¢_¶¢=    ¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø \n");
	printf("                                                °¨_£Ø      °¨_0=======0=======0======0=£Ø    °¨ _£Ø   \n");
}
void end3(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("                                            (  ) (@@) ( )       @@      ()          \n");
	printf("                                                  (@@@)\n");
	printf("                                              (      )\n");
	printf("                                               ======            ________                    ______________\n");
	printf("                                             _D__¶¢ ¶¢__________£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf("                                             ¶¢(_)---    ¶¢   H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("                                            £Ø     ¶¢   ¶¢   H   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("                                           ¶¢      ¶¢   ¶¢   H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf("                                           ¶¢  _________¶¢___H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("                                           ¶¢£Ø   ¶¢ ¶¢-------------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf("                                              __£Ø   =¶¢o¶¢=-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("                                           ¶¢£Ø-== ¶¢_¶¢=    ¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø \n");
	printf("                                            °¨_£Ø      °¨_0=======0=======0======0=£Ø    °¨ _£Ø   \n");
}
void end4(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("                                         (  ) (@@) ( )       @@      ()          \n");
	printf("                                               (@@@)\n");
	printf("                                          (      )\n");
	printf("                                           ======            ________                    ______________\n");
	printf("                                        _D__¶¢ ¶¢__________£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf("                                        ¶¢(_)---    ¶¢   H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("                                        £Ø     ¶¢   ¶¢   H   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("                                       ¶¢      ¶¢   ¶¢   H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf("                                       ¶¢  _________¶¢___H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("                                       ¶¢£Ø   ¶¢ ¶¢-------------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf("                                          __£Ø   =¶¢o¶¢=-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("                                       ¶¢£Ø-== ¶¢_¶¢=    ¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø \n");
	printf("                                        °¨_£Ø      °¨_0=======0=======0======0=£Ø    °¨ _£Ø   \n");
}
void end5(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("                                   (  ) (@@) ( )       @@      ()          \n");
	printf("                                         (@@@)\n");
	printf("                                    (      )\n");
	printf("                                     ======            ________                    ______________\n");
	printf("                                  _D__¶¢ ¶¢__________£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf("                                  ¶¢(_)---    ¶¢   H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("                                  £Ø     ¶¢   ¶¢   H   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("                                  ¶¢      ¶¢   ¶¢   H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf("                                  ¶¢  _________¶¢___H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("                                  ¶¢£Ø   ¶¢ ¶¢-------------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf("                                     __£Ø   =¶¢o¶¢=-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("                                  ¶¢£Ø-== ¶¢_¶¢=    ¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø \n");
	printf("                                   °¨_£Ø      °¨_0=======0=======0======0=£Ø    °¨ _£Ø   \n");
}
void end6(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("                             (  ) (@@) ( )       @@      ()          \n");
	printf("                                   (@@@)\n");
	printf("                              (      )\n");
	printf("                               ======            ________                    ______________\n");
	printf("                            _D__¶¢ ¶¢__________£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf("                            ¶¢(_)---    ¶¢   H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("                            £Ø     ¶¢   ¶¢   H   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("                            ¶¢      ¶¢   ¶¢   H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf("                            ¶¢  _________¶¢___H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("                            ¶¢£Ø   ¶¢ ¶¢-------------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf("                              __£Ø   =¶¢o¶¢=-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("                            ¶¢£Ø-== ¶¢_¶¢=    ¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø \n");
	printf("                             °¨_£Ø      °¨_0=======0=======0======0=£Ø    °¨ _£Ø   \n");
}
void end7(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("                       (  ) (@@) ( )       @@      ()          \n");
	printf("                             (@@@)\n");
	printf("                        (      )\n");
	printf("                         ======            ________                    ______________\n");
	printf("                      _D__¶¢ ¶¢__________£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf("                      ¶¢(_)---    ¶¢   H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("                      £Ø     ¶¢   ¶¢   H   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("                      ¶¢      ¶¢   ¶¢   H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf("                      ¶¢  _________¶¢___H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("                      ¶¢£Ø   ¶¢ ¶¢-------------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf("                         __£Ø   =¶¢o¶¢=-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("                      ¶¢£Ø-== ¶¢_¶¢=    ¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø \n");
	printf("                       °¨_£Ø      °¨_0=======0=======0======0=£Ø    °¨ _£Ø   \n");
}
void end8(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("                 (  ) (@@) ( )       @@      ()          \n");
	printf("                       (@@@)\n");
	printf("                  (      )\n");
	printf("                   ======            ________                    ______________\n");
	printf("                _D__¶¢ ¶¢__________£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf("                ¶¢(_)---    ¶¢   H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("               £Ø     ¶¢   ¶¢   H   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("                ¶¢      ¶¢   ¶¢   H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf("                ¶¢  _________¶¢___H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("                ¶¢£Ø   ¶¢ ¶¢-------------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf("                   __£Ø   =¶¢o¶¢=-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("                ¶¢£Ø-== ¶¢_¶¢=    ¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø \n");
	printf("                 °¨_£Ø      °¨_0=======0=======0======0=£Ø    °¨ _£Ø   \n");
}
void end9(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("           (  ) (@@) ( )       @@      ()          \n");
	printf("                 (@@@)\n");
	printf("            (      )\n");
	printf("             ======            ________                    ______________\n");
	printf("           _D__¶¢ ¶¢__________£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf("          ¶¢(_)---    ¶¢   H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("         £Ø     ¶¢   ¶¢   H   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("          ¶¢      ¶¢   ¶¢   H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf("          ¶¢  _________¶¢___H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("          ¶¢£Ø   ¶¢ ¶¢-------------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf("             __£Ø   =¶¢o¶¢=-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("          ¶¢£Ø-== ¶¢_¶¢=    ¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø                        made  by \n");
	printf("           °¨_£Ø      °¨_0=======0=======0======0=£Ø    °¨ _£Ø                        \n");
}
void end10(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("     (  ) (@@) ( )       @@      ()          \n");
	printf("          (@@@)\n");
	printf("      (      )\n");
	printf("       ======            ________                    ______________\n");
	printf("     _D__¶¢ ¶¢__________£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf("    ¶¢(_)---    ¶¢   H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("   £Ø     ¶¢   ¶¢   H   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("    ¶¢      ¶¢   ¶¢   H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf("    ¶¢  _________¶¢___H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("    ¶¢£Ø   ¶¢ ¶¢-------------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf("       __£Ø   =¶¢o¶¢=-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("    ¶¢£Ø-== ¶¢_¶¢=    ¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø                        made by ±«øµ¿Á\n");
	printf("     °¨_£Ø      °¨_0=======0=======0======0=£Ø    °¨ _£Ø   \n");
}
void end11(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("  ) (@@) ( )       @@      ()          \n");
	printf("    (@@@)\n");
	printf("(      )\n");
	printf(" ======            ________                    ______________\n");
	printf("D__¶¢ ¶¢__________£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf("_)---    ¶¢   H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("   ¶¢   ¶¢   H   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("     ¶¢   ¶¢   H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf(" _________¶¢___H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("   ¶¢ ¶¢-------------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf(" __£Ø   =¶¢o¶¢=-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("-== ¶¢_¶¢=    ¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø                             made by ±«øµ¿Á ¿ØπŒºÆ\n");
	printf("_£Ø      °¨_0=======0=======0======0=£Ø    °¨ _£Ø\n");
}
void end12(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("@) ( )       @@      ()          \n");
	printf("@@)\n");
	printf(" )\n");
	printf("=            ________                    ______________\n");
	printf("__________£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf("   ¶¢   H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf(" ¶¢   H   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("   ¶¢   H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf(" ___¶¢___H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("-------------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf(" =¶¢o¶¢=-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("¶¢=    ¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø                              made by ±«øµ¿Á ¿ØπŒºÆ Ω…πŒ»£\n");
	printf(" °¨_0=======0=======0======0=£Ø    °¨ _£Ø\n");
}
void end13(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("       @@      ()          \n");
	printf("\n");
	printf("\n");
	printf("       ________                    ______________\n");
	printf("____£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf(" H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf(" H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf("__H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("-------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf("-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø                          made by ±«øµ¿Á ¿ØπŒºÆ Ω…πŒ»£ ±Ë¿±º±\n");
	printf("=====0=======0======0=£Ø    °¨ _£Ø\n");
}
void end14(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf(" @@      ()          \n");
	printf("\n");
	printf("\n");
	printf(" ________                    ______________\n");
	printf("       °¨__I__I______===__¶¢____________¶¢\n");
	printf("______£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf(" ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("___----------------------¶¢  [_____]  ¶¢ \n");
	printf("£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("-I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf("£Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø                           made by ±«øµ¿Á ¿ØπŒºÆ Ω…πŒ»£ ±Ë¿±º±\n");
	printf("=======0======0=£Ø    °¨ _£Ø\n");
}
void end15(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("   ()          \n");
	printf("\n");
	printf("\n");
	printf("___                    ______________\n");
	printf(" °¨__I__I______===__¶¢____________¶¢\n");
	printf("£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("-------------------¶¢  [_____]  ¶¢ \n");
	printf("__£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("I   [][]  []    D  ¶¢===========¶¢\n");
	printf("£Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("¶¢    ¶¢____£Ø~°¨___£Ø                           made by ±«øµ¿Á ¿ØπŒºÆ Ω…πŒ»£ ±Ë¿±º±\n");
	printf("=0======0=£Ø    °¨ _£Ø \n");
}
void end16(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("                 ______________\n");
	printf("_I______===__¶¢____________¶¢\n");
	printf("¶¢        =¶¢_____ _____¶¢  \n");
	printf("        ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("-------------¶¢  [_____]  ¶¢ \n");
	printf("]~°¨________¶¢           ¶¢\n");
	printf("[]  []    D  ¶¢===========¶¢\n");
	printf("~~°¨ ____Y_______________¶¢\n");
	printf("____£Ø~°¨___£Ø                        made by ±«øµ¿Á ¿ØπŒºÆ Ω…πŒ»£ ±Ë¿±º±\n");
	printf("==0=£Ø    °¨ _£Ø\n");
}
void end17(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("           ______________\n");
	printf("__===__¶¢____________¶¢\n");
	printf("   =¶¢_____ _____¶¢  \n");
	printf("  ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("-------¶¢  [_____]  ¶¢ \n");
	printf("_____¶¢           ¶¢\n");
	printf("    D  ¶¢===========¶¢\n");
	printf("__Y_______________¶¢\n");
	printf("°¨___£Ø                       made by ±«øµ¿Á ¿ØπŒºÆ Ω…πŒ»£ ±Ë¿±º±\n");
	printf("   °¨ _£Øn");
}
void end18(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("     ______________\n");
	printf("_¶¢____________¶¢\n");
	printf("____ _____¶¢  \n");
	printf(" ¶¢_¶¢¶¢ \n");
	printf("-¶¢  [_____]  ¶¢ \n");
	printf("           ¶¢\n");
	printf(" ¶¢===========¶¢\n");
	printf("____________¶¢\n");
	printf("                         made by ±«øµ¿Á ¿ØπŒºÆ Ω…πŒ»£ ±Ë¿±º±\n");
	printf("\n");
}
void end19(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("_____________\n");
	printf("________¶¢\n");
	printf("____¶¢  \n");
	printf("\n");
	printf("____]  ¶¢ \n");
	printf("     ¶¢\n");
	printf("=======¶¢\n");
	printf("______¶¢\n");
	printf("              made by ±«øµ¿Á ¿ØπŒºÆ Ω…πŒ»£ ±Ë¿±º±\n");
	printf(" \n");
}
void end20(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("_______\n");
	printf("__¶¢\n");
	printf(" \n");
	printf("\n");
	printf(" ¶¢ \n");
	printf("\n");
	printf("=¶¢\n");
	printf("¶¢\n");
	printf("    made by ±«øµ¿Á ¿ØπŒºÆ Ω…πŒ»£ ±Ë¿±º±\n");
	printf("\n");
}
void end21(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("de by ±«øµ¿Á ¿ØπŒºÆ Ω…πŒ»£ ±Ë¿±º±\n");
	printf(" \n");
}
void end22(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("±«øµ¿Á ¿ØπŒºÆ Ω…πŒ»£ ±Ë¿±º±\n");
	printf(" \n");
}
void end23(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("¿ØπŒºÆ Ω…πŒ»£ ±Ë¿±º±\n");
	printf("\n");
}
void end24(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("Ω…πŒ»£ ±Ë¿±º±\n");
	printf(" \n");
}
void end25(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("±Ë¿±º±\n");
	printf("n");
}
void end26(){
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
}
void end(){
	end1();
	Sleep(500);
	system("cls");
	end2();
	Sleep(500);
	system("cls");
	end3();
	Sleep(500);
	system("cls");
	end4();
	Sleep(500);
	system("cls");
	end5();
	Sleep(500);
	system("cls");
	end6();
	Sleep(500);
	system("cls");
	end7();
	Sleep(500);
	system("cls");
	end8();
	Sleep(500);
	system("cls");
	end9();
	Sleep(500);
	system("cls");
	end10();
	Sleep(500);
	system("cls");
	end11();
	Sleep(500);
	system("cls");
	end12();
	Sleep(500);
	system("cls");
	end13();
	Sleep(500);
	system("cls");
	end14();
	Sleep(500);
	system("cls");
	end15();
	Sleep(500);
	system("cls");
	end16();
	Sleep(500);
	system("cls");
	end17();
	Sleep(500);
	system("cls");
	end18();
	Sleep(500);
	system("cls");
    end19();
	Sleep(500);
	system("cls");
	end20();
	Sleep(500);
	system("cls");
	end21();
	Sleep(500);
	system("cls");	
	end22();
	Sleep(500);
	system("cls");	
	end23();
	Sleep(500);
	system("cls");	
	end24();
	Sleep(500);
	system("cls");	
	end25();
	Sleep(500);
	system("cls");	
	end26();
	Sleep(500);
	system("cls");	
}



/***************************************************************
	∏≈∞≥∫Øºˆ : æ¯¿Ω
	±‚¥…	    : ≈∏¿Ã∆≤ ∏ﬁ¥∫
****************************************************************/
void titleMenu(){
	printf("\n\n\n\n");
	printf(" ¶¨¶∂¶¨  ¶≠  ¶¨¶∂¶¨  ¶≠  ¶¨¶≥¶¨¶≥¶¨  ¶¨¶≥¶¨¶≥¶¨\n");
	printf("   ¶≠    ¶≠    ¶≠    ¶≠    ¶≠  ¶≠      ¶≠  ¶≠ \n");
	printf(" ¶Æ¶µ¶Ø  ¶≠  ¶Æ¶µ¶Ø  ¶≠  ¶¨¶µ¶¨¶µ¶¨  ¶¨¶µ¶¨¶µ¶¨ \n");
	printf(" ¶≠  ¶≠  ¶≠  ¶≠  ¶≠  ¶≠      ¶≠          ¶≠\n");
	printf("                         ¶¨¶¨¶µ¶¨¶¨  ¶¨¶¨¶µ¶¨¶¨ \n");
	printf("   ¶¨¶¨¶¨¶Ø   ¶¨¶¨¶¨¶Ø    ¶¨¶¨¶¨¶Ø    ¶¨¶¨¶¨¶Ø                          (  ) (@@) ( )       @@      ()          \n");
	printf("         ¶≠         ¶≠          ¶≠          ¶≠                    (@@@)\n");
	printf("         ¶≠         ¶≠          ¶≠          ¶≠               (      )\n");
	printf("                                                          ======            ________                    ______________\n");
	printf("                                                       _D__¶¢ ¶¢__________£Ø        °¨__I__I______===__¶¢____________¶¢\n");
	printf("                                                       ¶¢(_)---    ¶¢   H °¨________£Ø¶¢    ¶¢        =¶¢_____ _____¶¢  \n");
	printf("                                                       £Ø     ¶¢   ¶¢   H   ¶¢   ¶¢   ¶¢    ¶¢         ¶¢¶¢_¶¢ ¶¢_¶¢¶¢ \n");
	printf("                                                      ¶¢      ¶¢   ¶¢   H   ¶¢___----------------------¶¢  [_____]  ¶¢ \n");
	printf("                       1. login                       ¶¢  _________¶¢___H___£Ø___¶¢___£Ø[][]~°¨________¶¢           ¶¢\n");
	printf("                       2. sign up                     ¶¢£Ø   ¶¢ ¶¢-------------I____I   [][]  []    D  ¶¢===========¶¢\n");
	printf("                       3. find password              __£Ø   =¶¢o¶¢=-~~°¨  £Ø~~°¨  £Ø~~°¨ £Ø~~°¨ ____Y_______________¶¢\n");
	printf("                       4. Exit                       ¶¢£Ø-== ¶¢_¶¢=    ¶¢¶¢    ¶¢¶¢   ¶¢¶¢    ¶¢____£Ø~°¨___£Ø \n");
	printf("                                                       °¨_£Ø      °¨_0=======0=======0======0=£Ø    °¨ _£Ø   \n");
}


/***************************************************************
	∏≈∞≥∫Øºˆ : æ¯¿Ω
	±‚¥…	    : ∞¸∏Æ¿⁄ æ∆¿Ãµ ª˝º∫
****************************************************************/
void makeRoot(){
	char tmp_id[11];
	FILE *fp = fopen("Person.txt","a+");
	if(fp == NULL){
		printf("ERROR OPEN FILE");
		exit(1);
	}
	fseek(fp,0,SEEK_SET);
	fscanf(fp,"%s",tmp_id);
	if(strcmp("root",tmp_id) != 0){
		fprintf(fp,"root\n");
		fprintf(fp,"1\n");
		fprintf(fp,"±«øµ¿Á\n");
		fprintf(fp,"01037370424\n");
		fprintf(fp,"23\n");
		fprintf(fp,"≥≤\n");
		fprintf(fp,"0\n\n");
	}


	fclose(fp);
}




/***************************************************************
	∏≈∞≥∫Øºˆ : æ¯¿Ω
	±‚¥…	    : ∏ﬁ¿Œ ¡÷ø‰ «‘ºˆ
****************************************************************/
void title(){
	Person p;
	int key;
	makeRoot();
	//√ ±‚ƒøº≠º≥¡§.
	curX=20;
	curY=18;
	hideCursor();
	while(1){
		system("cls");
		titleMenu();
		key = get4MenuSelect();
		if(key!=0){
			switch(key-17){
			case 1://∑Œ±◊¿Œ				
				system("cls");
				login();
				break;
			case 2://»∏ø¯∞°¿‘ ∏ﬁ¥∫				
				system("cls");
				signUp();
				while(getId(&p) != 1);
				while(getPw(&p) != 1);
				while(getName(&p) != 1);
				while(getAge(&p) !=1 );
				while(getGender(&p) !=1 );
				while(getPhonNum(&p) != 1);	
				inputPerson(&p);
				break;		
			case 3://∫Òπ¯√£±‚				
				system("cls");
				findPw();
				break;
			case 4://¡æ∑·				
				system("cls");
				end();
				exit(1);
			}
		}
	}

}